<!-- 1 пункт -->

<?php
/*
$i = 0;
while (++$i <= 100) {
    if ($i % 3 == 0) {
        echo $i . "<br>";
    }
}
*/
?>

<!-- 2 пункт -->

<?php
/*
$i = 0;
do {
    if ($i == 0) {
        echo $i . " - ноль" . "<br>";
    } elseif ($i % 2 == 0) {
        echo $i . " - четное число" . "<br>";
    } else {
        echo $i . " - нечетное число" . "<br>";
    }
} while (++$i <= 10);
*/
?>

<!-- 3 пункт -->

<?php/*
$cities = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область' => ['Рязань', 'Скопин', 'Михайлов'],
    'Ростовская область' => ['Ростов-на-дону', 'Азов', 'Таганрог']
];
foreach ($cities as $key => $value) {
    foreach ($value as $item) {
        $towns = implode(', ', $value);
    };
    echo "{$key}: {$towns} <br>";
}*/
?>

<!-- 4 пункт -->

<?php

/*
    пробовал решить его через разбитие слова на массив букв
    и дальнейший перебор этого массива с заменой русских букв на английские,
    но в итоге нашел вариант получше
*/
/*
function transliterate(string $word): string {
    $dictionary = [
        'а'=> 'a',
        'б' => 'b',
        'в' => 'v',
        'г' => 'g',
        'д' => 'd',
        'е' => 'e',
        'ё' => 'yo',
        'ж' => 'zh',
        'з' => 'z',
        'и' => 'i',
        'й' => 'j',
        'к' => 'k',
        'л' => 'l',
        'м' => 'm',
        'н' => 'n',
        'о' => 'o',
        'п' => 'p',
        'р' => 'r',
        'с' => 's',
        'т' => 't',
        'у' => 'u',
        'ф' => 'f',
        'х' => 'kh',
        'ц' => 'ts',
        'ч' => 'ch',
        'ш' => 'sh',
        'щ' => 'shch',
        'ъ' => '`',
        'ы' => 'y',
        'ь' => '`',
        'э' => 'e',
        'ю' => 'yu',
        'я' => 'ya'
    ];
    return strtr($word, $dictionary);
//    $letters = explode('', $word); // видимо работает только с разбитем предложений на слова
//    var_dump($letters);
}
echo transliterate('Вау, это работает!'); // Вau, eto rabotaet!
//$word = 'строка';
//$letters = str_split ($word); // не работает с кириллицей
//var_dump($letters);
*/
?>

<!-- 5 пункт -->

<?php
/*
function changeSpases (string $stroke): string {
    $expLetter = explode(' ', $stroke);
    return implode('_', $expLetter);
}
echo changeSpases('Тут это тоже работает'); // Тут_это_тоже_работает
*/
?>

<!-- 6 пункт -->

<?php
/*
    не знаю возможно ли здесь как то реализовать меню
    соблюдая принцип php отдельно, верстка отдельно
*/
$title = "Какой-то важный заголовок";
$content = "Не менее важный текст";
$date = date(' \t\h\e jS \o\f F Y, l');
$menu = [
    "Main",
    "Catalog",
    "Contacts"
];

?>

<h1><?php echo $title ?> </h1>
<p><?= $content ?></p>
<p>Сегодня: <?= $date ?></p>
<ul>
    <?php foreach ($menu as $value) {
        echo "<li>";
            echo "{$value}";
        echo "</li>";
    };
    ?>
</ul>
